#include "bsp_common.h"

/****************************************************************************
* 名	称：void Delay(u32 nCount)
* 功	能：一个工作的频率延时
* 入口参数：u32 nCount	延时量
* 出口参数：无
* 说	明：无
****************************************************************************/
//void Delay(u32 nCount)
//{
//  while(nCount--);
//}

/****************************************************************************
* 名	称：void Delay_US(u32 nCount_temp)
* 功	能：微秒级
* 入口参数：u32 nCount_temp	延时量
* 出口参数：无
* 说	明：无
****************************************************************************/
void Delay_US(u32 nCount_temp)
{
	u32 nCount=nCount_temp*8;
	while(nCount--);
}

/****************************************************************************
* 名	称：void Delay_MS(u32 nCount_temp)
* 功	能：毫秒级
* 入口参数：u32 nCount_temp	延时量
* 出口参数：无
* 说	明：无
****************************************************************************/
void Delay_MS(u32 nCount_temp)
{
	u32 nCount=nCount_temp*8000;
	while(nCount--);
}

/****************************************************************************
* 名	称：void Delay_S(u32 nCount_temp)
* 功	能：秒级
* 入口参数：u32 nCount_temp	延时量
* 出口参数：无
* 说	明：无
****************************************************************************/
void Delay_S(u32 nCount_temp)
{
	u32 nCount=nCount_temp*8000000;
	while(nCount--);
}

/****************************************************************************
* 名	称：__asm void NOPDelay(void)
* 功	能：NOP指令周期延迟	   (差不多一个延迟1微秒)
* 入口参数：无
* 出口参数：无
* 说	明：调用一次延时一个系统时钟周期	  
****************************************************************************/
__asm void NOPDelay(void)	  //NOP指令周期级延迟
{
	NOP;
}
